# Pandas

- Pandas is a Python library used for working with data sets.
- It has functions for analyzing, cleaning, exploring, and manipulating data.
- The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

**WHY**
- Pandas allows us to analyze big data and make conclusions based on statistical theories.
- Pandas can clean messy data sets, and make them readable and relevant.

In [117]:
#Installation of Pandas
pip install pandas

SyntaxError: invalid syntax (<ipython-input-117-bfb72f9ad9b6>, line 2)

In [118]:
pip install pandas

Requirement already satisfied: pandas in c:\users\jayaram\anaconda3\lib\site-packages (1.1.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\jayaram\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\jayaram\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\jayaram\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\jayaram\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [4]:
#how to use 
import pandas

In [9]:
import pandas

dataset = {
  'Name': ["Mani", "Honey", "sony"],
  'Age': [6, 4, 2]
}

D = pandas.DataFrame(dataset)

print(D.to_string()) #print(D)

    Name  Age
0   Mani    6
1  Honey    4
2   sony    2

In [6]:
D

    Name  Age
0   Mani    6
1  Honey    4
2   sony    2

In [10]:
#alias
import pandas as pd

In [11]:
dataset = {
  'Name': ["Mani", "Honey", "sony"],
  'Age': [6, 4, 2]
}

D = pd.DataFrame(dataset)

print(D.to_string()) #print(D)

    Name  Age
0   Mani    6
1  Honey    4
2   sony    2

In [12]:
#version
print(pd.__version__)

1.1.3

***Series***

- A Pandas Series is like a column in a table.
- It is a one-dimensional array holding data of any type.

In [14]:
a = [1, 7, 2]
pd.Series(a)

0    1
1    7
2    2
dtype: int64

In [17]:
A = pd.Series(a, index = ["x", "y", "z"]) #we can we give index

In [20]:
#Extract pirticular value
A['z']

2

In [123]:
a = {'A'[1,2,3,4],'B':[4,5,6,7],'C':[5,9,10,9]}

SyntaxError: invalid syntax (<ipython-input-123-f6e1cc202090>, line 1)

In [124]:
a = {'A':[1,2,3,4],'B':[2,3,4,5],'C':[2,3,4,5]}

In [126]:
a['B'][2]

4

In [131]:
dataset = {
  'Name': ["Mani", "Honey", "sony"],
  'Age': [6, 4, 2]
}

D = pandas.DataFrame(dataset)

In [23]:
D

    Name  Age
0   Mani    6
1  Honey    4
2   sony    2

In [26]:
D.iloc[1]

Name    Honey
Age         4
Name: 1, dtype: object

In [30]:
x = D.iloc[1]

In [31]:
x

Name    Honey
Age         4
Name: 1, dtype: object

In [34]:
D['Age'][1]

4

In [133]:
y = D[['Age']]

In [134]:
y

   Age
0    6
1    4
2    2

In [38]:
D.Age

0    6
1    4
2    2
Name: Age, dtype: int64

In [40]:
#Read CSV file

data = pd.read_csv('DailyTotalFemaleBirths.csv')
data

           Date  Births
0      1/1/1959      35
1      1/2/1959      32
2      1/3/1959      30
3      1/4/1959      31
4      1/5/1959      44
..          ...     ...
360  12/27/1959      37
361  12/28/1959      52
362  12/29/1959      48
363  12/30/1959      55
364  12/31/1959      50

[365 rows x 2 columns]

In [41]:
#view the data
data.head()

       Date  Births
0  1/1/1959      35
1  1/2/1959      32
2  1/3/1959      30
3  1/4/1959      31
4  1/5/1959      44

In [42]:
data.tail()

           Date  Births
360  12/27/1959      37
361  12/28/1959      52
362  12/29/1959      48
363  12/30/1959      55
364  12/31/1959      50

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    365 non-null    object
 1   Births  365 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

In [44]:
data.shape

(365, 2)

In [45]:
data.isnull().sum()

Date      0
Births    0
dtype: int64

In [135]:
data = pd.read_csv('mtcars.csv')
data.head()

,car_model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

In [54]:
data.isnull().sum()

car_model    0
mpg          0
cyl          0
disp         0
hp           0
drat         0
wt           0
qsec         0
vs           0
am           0
gear         0
carb         0
dtype: int64

In [55]:
data.columns

Index(['car_model', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs',
       'am', 'gear', 'carb'],
      dtype='object')

In [56]:
len(data.columns)

12

In [136]:
x  = data[['car_model','mpg']]

In [137]:
x

              car_model   mpg
0             Mazda RX4  21.0
1         Mazda RX4 Wag  21.0
2            Datsun 710  22.8
3        Hornet 4 Drive  21.4
4            Datsun 710  22.8
5               Valiant  18.1
6            Duster 360  14.3
7             Valiant 2  18.1
8               Valiant  18.1
9              Merc 280  19.2
10            Merc 280C  17.8
11           Merc 450SE  16.4
12           Merc 450SL  17.3
13          Merc 450SLC  15.2
14   Cadillac Fleetwood  10.4
15  Lincoln Continental  10.4
16    Chrysler Imperial  14.7
17             Fiat 128  32.4
18          Honda Civic  30.4
19       Toyota Corolla  33.9
20        Toyota Corona  21.5
21     Dodge Challenger  15.5
22          AMC Javelin  15.2
23           Camaro Z28  13.3
24     Pontiac Firebird  19.2
25            Fiat X1-9  27.3
26        Porsche 914-2  26.0
27         Lotus Europa  30.4
28       Ford Pantera L  15.8
29         Ferrari Dino  19.7
30        Maserati Bora  15.0
31           Volvo 142E  21.4

In [59]:
x.head()

        car_model   mpg
0       Mazda RX4  21.0
1   Mazda RX4 Wag  21.0
2      Datsun 710  22.8
3  Hornet 4 Drive  21.4
4      Datsun 710  22.8

In [60]:
x.dtypes

car_model     object
mpg          float64
dtype: object

In [138]:
x.car_model.unique()

array(['Mazda RX4', 'Mazda RX4 Wag', 'Datsun 710', 'Hornet 4 Drive',
       'Valiant', 'Duster 360', 'Valiant 2', 'Merc 280', 'Merc 280C',
       'Merc 450SE', 'Merc 450SL', 'Merc 450SLC', 'Cadillac Fleetwood',
       'Lincoln Continental', 'Chrysler Imperial', 'Fiat 128',
       'Honda Civic', 'Toyota Corolla', 'Toyota Corona',
       'Dodge Challenger', 'AMC Javelin', 'Camaro Z28',
       'Pontiac Firebird', 'Fiat X1-9', 'Porsche 914-2', 'Lotus Europa',
       'Ford Pantera L', 'Ferrari Dino', 'Maserati Bora', 'Volvo 142E'],
      dtype=object)

In [139]:
len(x.car_model.unique())

30

In [140]:
len(x.car_model)

32

In [141]:
x.car_model

0               Mazda RX4
1           Mazda RX4 Wag
2              Datsun 710
3          Hornet 4 Drive
4              Datsun 710
5                 Valiant
6              Duster 360
7               Valiant 2
8                 Valiant
9                Merc 280
10              Merc 280C
11             Merc 450SE
12             Merc 450SL
13            Merc 450SLC
14     Cadillac Fleetwood
15    Lincoln Continental
16      Chrysler Imperial
17               Fiat 128
18            Honda Civic
19         Toyota Corolla
20          Toyota Corona
21       Dodge Challenger
22            AMC Javelin
23             Camaro Z28
24       Pontiac Firebird
25              Fiat X1-9
26          Porsche 914-2
27           Lotus Europa
28         Ford Pantera L
29           Ferrari Dino
30          Maserati Bora
31             Volvo 142E
Name: car_model, dtype: object

In [85]:
data = pd.read_excel('students.xlsx')
data

   Student A  Student B  Student C
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
3         55        NaN       67.0
4         50       67.0       78.0
5         60       89.0        NaN

In [66]:
data.isnull().sum()

Student A    0
Student B    1
Student C    1
dtype: int64

In [68]:
data.isnull()

   Student A  Student B  Student C
0      False      False      False
1      False      False      False
2      False      False      False
3      False       True      False
4      False      False      False
5      False      False       True

In [72]:
data.fillna(50)

   Student A  Student B  Student C
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
3         55       50.0       67.0
4         50       67.0       78.0
5         60       89.0       50.0

In [73]:
data.isnull().sum()

Student A    0
Student B    1
Student C    1
dtype: int64

In [86]:
data.fillna(50,inplace=True)

In [75]:
data.isnull().sum()

Student A    0
Student B    0
Student C    0
dtype: int64

In [80]:
data.columns

Index(['Student A', 'Student B', 'Student C'], dtype='object')

In [87]:
#change column name
data = data.rename(columns={'Student A':'A'})

In [88]:
data

    A  Student B  Student C
0  40       45.0       87.0
1  45       43.0       75.0
2  50       45.0       34.0
3  55       50.0       67.0
4  50       67.0       78.0
5  60       89.0       50.0

In [144]:
data = pd.read_excel('students.xlsx')
data.head()

   Student A  Student B  Student C
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
3         55        NaN       67.0
4         50       67.0       78.0

In [145]:
data.dropna(inplace=True)

In [146]:
data

   Student A  Student B  Student C
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
4         50       67.0       78.0

In [147]:
#empty column
data['new'] = ' '

In [148]:
data

   Student A  Student B  Student C new
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
4         50       67.0       78.0

In [94]:
#correlation
data.corr()

           Student A  Student B  Student C
Student A   1.000000   0.520435  -0.642859
Student B   0.520435   1.000000   0.243856
Student C  -0.642859   0.243856   1.000000

In [95]:
data.corr()['Student C']

Student A   -0.642859
Student B    0.243856
Student C    1.000000
Name: Student C, dtype: float64

In [97]:
data['new'] = data['Student B'].apply(lambda x: x*x)

In [98]:
data

   Student A  Student B  Student C     new
0         40       45.0       87.0  2025.0
1         45       43.0       75.0  1849.0
2         50       45.0       34.0  2025.0
4         50       67.0       78.0  4489.0

In [100]:
data['New_string'] = ['your_age','Your_task','your_money','your_stack']

In [101]:
data

   Student A  Student B  Student C     new  New_string
0         40       45.0       87.0  2025.0    your_age
1         45       43.0       75.0  1849.0   Your_task
2         50       45.0       34.0  2025.0  your_money
4         50       67.0       78.0  4489.0  your_stack

In [111]:
data = pd.read_excel('students.xlsx')

In [113]:
data.head()

   Student A  Student B  Student C
0         40       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
3         55        NaN       67.0
4         50       67.0       78.0

In [115]:
#replace
data.replace(to_replace=40,value=100)

   Student A  Student B  Student C
0        100       45.0       87.0
1         45       43.0       75.0
2         50       45.0       34.0
3         55        NaN       67.0
4         50       67.0       78.0
5         60       89.0        NaN